Revit 2027 API
Mesh.GetNormal Method
 Returns a normal unit vector at the given index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetNormal(
	int idx
)
Public Function GetNormal (
	idx As Integer
) As XYZ
public:
XYZ^ GetNormal(
	int idx
)
member GetNormal :
        idx : int -> XYZ
Parameters
idx Int32
 A zero-based index. It must be consistent with the DistributionOfNormals.
Return Value
XYZ
 XYZ value representing a normal unit vector.
Exceptions
Exception | Condition
ArgumentException |  The given value is not a valid index of a normal of the mesh. A valid value is not negative and is smaller than the number of normals in the mesh.
See Also
Reference
Mesh Class
Autodesk.Revit.DB Namespace